Repository: 84000/data-translation-memory
Catalog: Toh_152-The_Questions_of_Sagaramati-v2.tmx
Source language: bo
Languages: en

source: སྡུག་བསྔལ་བདེ་བས་མི་གཡོས་ས་དང་མཚུངས། །
en: “Be unshaken by pleasure or pain, like earth.

source: བསམ་པ་དག་པས་ཆུ་ལྟར་དྲི་མ་འཁྲུ། །
en: With a pure intention, cleanse stains, like water.

source: རྟག་ཏུ་རློམ་སེམས་མེད་པས་མེ་དང་མཚུངས། །
en: Eliminate conceitedness for good, like fire.

source: གནས་མེད་རྒྱུ་བས་རྟག་ཏུ་རླུང་དང་འདྲ། །
en: Always be on the move without a fixed abode, like wind.

source: ཤིན་ཏུ་དྲི་མ་མེད་པས་མཁའ་མཉམ་སེམས། །
en: “Let your mind be immaculate, like space.

source: རབ་ཏུ་བྱུང་བས་སངས་རྒྱས་བསྟན་པ་རྙེད། །
en: Go forth and discover the Buddha’s teachings.

source: ལུས་ནི་དབེན་ཞིང་ཞི་བས་དགོན་པར་དགའ། །
en: Enjoy solitude where you are peaceful and physically aloof.

source: སེམས་དབེན་པས་ནི་ཆོས་ཀྱི་མཆོག་ལ་སྤྱོད། །
en: Practice the supreme Dharma by being mentally aloof.

source: དགེ་བ་བདེན་པར་སྨྲ་དང་ཡང་དག་སྨྲ། །
en: “Speak truthfully of virtue and speak genuinely.

source: ཇི་སྐད་སྨྲས་པ་དེ་ནི་དེ་བཞིན་བྱེད། །
en: Practice exactly what you preach.

source: ཉོན་མོངས་མི་རྫི་དགེ་ལ་དཔའ་བོ་མཆོག །
en: Be heroic in virtue, untrammeled by afflictions.

source: ཤིན་ཏུ་བསླབས་པས་བསླབ་པ་ཡང་དག་འཛིན། །
en: Train thoroughly and hold to the genuine trainings.

source: དེ་ལ་ལྷོད་པ་ནམ་ཡང་ཡོད་མ་ཡིན། །
en: “Never allow any laxity in this pursuit.

source: ཁ་ན་མ་ཐོ་ཆུང་ལའང་རྟག་ཏུ་འཇིགས། །
en: Be ever wary of even trifling negativities.

source: བྱང་ཆུབ་མཆོག་རྒྱུའི་ཚུལ་ཁྲིམས་ཉམས་པ་མེད། །
en: Do not let your discipline deteriorate—it is the cause of supreme awakening.

source: ཡོན་ཏན་དཀར་སྤྱོད་ཚུལ་ཁྲིམས་འདྲེས་པ་མེད། །
en: Let your discipline be unadulterated; act for positive qualities.

source: དགེ་བའི་བཤེས་གཉེན་བསྟེན་ཅིང་སྡིག་པ་མིན། །
en: “Rely on a spiritual friend and do no evil.

source: !རྫོགས་པའི་བྱང་ཆུབ་སེམས་སོགས་བྱ་ཕྱིར་བརྟན། །
en: Be firm so that you may become a perfect bodhisattva.

source: དེ་ལྟར་དེ་ཡི་མིག་ནི་དྲི་མེད་ཀྱིས། །འཇིག་རྟེན་ཀུན་ལ་འོད་ཟེར་མཉམ་པར་ལྟ། །
en: In this manner, your eyes will become immaculate, And you will see the whole world in the same light.

source: མཁས་པ་དེ་ནི་སྣ་ཚོགས་སྒྲ་ཐོས་ནས། །དགའ་མེད་རངས་པ་མེད་ཅིང་ཞུམ་པ་མེད། །
en: “Such learned ones can hear many different messages And do not get excited, joyful, or discouraged.

source: བློ་ལྡན་དེ་ནི་སྒྲ་ཡི་དོན་རྟོགས་ཤེས། །
en: Such intelligent people come to understand the significance of sound.

source: དེ་ཡི་རྣ་བ་དེ་ལྟར་རྣམ་དག་ཉིད། །
en: Their ears thus become totally pure.

source: སྣ་ཡིས་དྲི་དང་ལྕེ་ཡིས་རོ་རྣམས་དང་། །
en: “When your nose meets scents, your tongue meets tastes,

source: ལུས་ཀྱིས་རེག་དང་ཡིད་ཀྱིས་ཆོས་རྣམས་ལ། །
en: Your body meets sensations, and your mind meets mental phenomena,

source: རེག་གནས་མ་ཁེངས་མ་དུད་ཞུམ་པ་མེད། །
en: Do not be arrogant, do not be cowardly, and do not be discouraged.

source: དེ་ལྟར་དེ་ཡི་དབང་པོ་དག་པ་ཉིད། །
en: In this manner, your faculties become pure.

source: ཆགས་པས་མི་ཆགས་སྡང་བས་སྡང་བ་མེད། །གཏི་མུག་མ་རྨོངས་མི་སྡུག་གནས་པ་ཅན། །བྱམས་ལ་དགའ་ཞིང་རྐྱེན་གྱིས་ཆོས་སེམས་པ། །
en: “Unsnared by attachment and unperturbed by anger, Not stupefied by delusion and sustaining the perception of ugliness, Take joy in love and utilize circumstances to contemplate Dharma.

source: སྒྲིབ་པ་ལྔ་པོ་དག་གིས་བསྒྲིབས་པ་མེད། །
en: “Eliminate obscuration through purifying the five obscurations.

source: དེ་ལྟར་དེས་ནི་དབང་པོ་ལྔ་ཡང་བསྒོམས། །དེ་ནི་གང་དུའང་སྒྲིབ་མེད་བཅིངས་པའང་མེད། །
en: In this fashion also cultivate the five faculties, And experience no obscuration or bondage whatsoever.

source: སྟོབས་རྣམས་ལྔ་པོ་དག་ལ་རབ་ཏུ་གནས། །
en: Immerse yourselves in all five strengths.

source: ཀུན་ནས་ལྡང་བ་ཤེས་ཤིང་བྱུང་བ་ཉིད། །
en: “Understand the workings of karma, and emerge from it.

source: ཚུལ་བཞིན་མ་ཡིན་སྤངས་ཤིང་ཚུལ་བཞིན་གནས། །
en: Discard the inappropriate and maintain what is right.

source: དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ལ་སྟེན། །
en: Rely on the four applications of mindfulness.

source: ཡང་དག་སྤོང་དང་རྫུ་འཕྲུལ་རྐང་པར་ལྡན། །
en: Possess right abandonment and the bases of miracles.

source: བྱང་ཆུབ་ཡན་ལག་སྟེན་དང་རྟག་ཏུ་ལྡན། །
en: “Always keep to the branches of awakening;

source: བརྟན་པ་དེ་ནི་ཡན་ལག་བརྒྱད་ལ་མཆོག །
en: Become steady and accomplished in the eight branches.

source: དེ་ནི་འདོད་དང་སྡང་དང་འཇིགས་མི་འགྲོ། །
en: Do not be driven by desire, anger, or fear.

source: གཏི་མུག་བྲལ་ཞིང་དབང་པོ་ཤིན་ཏུ་བསྡམས། །
en: Free yourselves from delusion, and restrain your faculties.

source: ཆོས་ཀྱི་སྦྱིན་ལ་དེ་ནི་སེར་སྣ་མེད། །
en: “Do not be stingy with the gift of Dharma.

source: སློབ་དཔོན་ནམ་ཡང་ཆོས་འཆབ་མི་བྱེད་དེ། །
en: Conceal nothing from your teachers.

source: ཟང་ཟིང་མེད་པར་ཆོས་ནི་སྟོན་པར་བྱེད། །
en: Teach Dharma without expecting wealth.

source: དེས་ན་དེ་ནི་བྱང་ཆུབ་སེམས་དག་འགྱུར། །
en: Thereby, the mind of awakening will become pure.

source: དེ་ནི་ཟང་ཟིང་རྣམས་ལ་ཀུན་འཛིན་མེད། །
en: “Lose all grasping to material things.

source: རྣམ་སྨིན་རེ་མེད་འདོད་དགུ་གཏོང་བར་བྱེད། །
en: Harbor no hope for karmic ripening and abandon all desires.

source: སྦྱིན་དང་སྙན་དང་དོན་བྱེད་དོན་འཐུན་པས། །
en: Practicing generosity, speak kindly, act meaningfully, and practice what you preach.

source: དེ་ནི་སེམས་ཅན་བརྒྱ་དག་རབ་ཏུ་སྡུད། །
en: Thus hundreds of beings will gather before you.

source: དེ་ཡི་བྱང་ཆུབ་སེམས་ནི་བརྗེད་མི་འགྱུར། །
en: “Never forget the mind of awakening.

source: ཐེག་པ་དམན་ལ་ནམ་ཡང་རེ་བ་མེད། །
en: Have no hope whatsoever for the Lesser Vehicle.

source: ཇི་ལྟ་ཇི་ལྟར་སངས་རྒྱས་ཡོན་ཏན་མཐོང་། །
en: See buddha qualities completely as they are.

source: !དེ་ལྟ་དེ་ལྟར་དེ་བསམ་རི་རབ་འདྲ། །
en: And in this manner be like mountains.

source: !ནང་ནི་རབ་ཞི་སྲིད་པའི་ཉེས་པ་མཐོང་། །
en: “Pacify all affliction and see the faults of cyclic existence.

source: དེ་ནི་གཞན་གྱི་འཁྲུལ་ལ་ལྟ་མི་བྱེད། །
en: Do not dwell on others’ confusion.

source: འདུས་བྱས་ཉེས་པ་དག་ཀྱང་ཤིན་ཏུ་མཐོང་།
en: Be highly cognizant of the faults of conditioned things.

source: འཁོར་བས་འཇིགས་པས་སྡིག་པ་རྣམས་མི་བྱེད། །
en: Be wary of saṃsāra, and do no evil deeds.

source: ལེགས་སྤྱོད་ཁུར་ཁྱེར་བས་ནི་སྐྱོ་བ་མེད། །
en: “Carry a supply of positive deeds and you will have no sadness.

source: ཞིང་རྣམས་སྦྱོང་བར་འདོད་པ་ཉམས་པ་མེད། །
en: Aim to purify realms, and allow no degeneration.

source: ཆོས་རྣམས་ཡོངས་སུ་བཟུང་བས་ཞུམ་པ་མེད། །
en: Embrace all phenomena, and be bold.

source: སེམས་ཅན་ཐར་བྱེད་རྒྱུ་ལ་འཇིགས་པ་མེད། །
en: Be fearless about what liberates beings.

source: ཆུ་བོ་བཞི་པོ་དག་ལས་བསྒྲལ་བའི་ཕྱིར། །
en: “Utilize the ship of Dharma To liberate beings from the four floods.

source: དེ་ནི་ཆོས་གྲུ་ཡང་དག་སྦྱོར་བར་བྱེད། །
en: Act like stairs and bridges.

source: ལུས་ཅན་མྱ་ངན་འདས་ལམ་གཟུད་པའི་ཕྱིར། །
en: That lead embodied beings on the path to nirvāṇa,

source: དེ་ནི་སྟེགས་དང་ཟམ་པ་འཆའ་བར་བྱེད། །འདམ་ལས་འདས་ཤིང་འོབས་ལས་བརྒལ་ནས་ནི། །
en: “Pass through marsh and trench, And you will live fearlessly, on level ground.

source: ཐང་ལ་གནས་ཤིང་དེ་དག་འཇིགས་མེད་གནས། །འཇིགས་པས་གཡེན་སྤྱོ་རྣམས་ལ་འཇིགས་མེད་སྟོན། །
en: Show your fearlessness to those who are dazed and struck by fear.

source: བདག་ཉིད་རྒལ་ནས་དེ་དག་གཞན་ཡང་སྒྲོལ། །
en: Transcend the self and liberate others.

source: གང་དག་ཆོས་ཚུལ་འདི་དག་རྣམ་དག་ཅིང་། །རྫོགས་པའི་བྱང་ཆུབ་སེམས་བརྟན་ཁ་ལོ་སྒྱུར། །
en: “Those who are pure in these Dharma ways Firmly navigate the perfect mind of awakening.

source: དེ་དག་བྱང་ཆུབ་སེམས་མཆོག་རྣམ་དག་སྟེ། །ཉོན་མོངས་དྲི་མས་གཞར་ཡང་གོས་མི་འགྱུར། །
en: With the pure, supreme mind of awakening, They will never again be sullied by the stains of afflictive emotions.

source: ཇི་སྟེ་ནམ་མཁའ་ཉོན་མོངས་བྱ་བར་ནུས། །དེ་ལ་རྗེས་ཀྱང་བསྟན་པར་ནུས་སྲིད་ཀྱི། །
en: “Were it possible to make the sky defiled, Then it would be possible for this to be demonstrated afterward.

source: རང་བཞིན་འོད་གསལ་རྫོགས་པའི་བྱང་ཆུབ་སེམས། །དེ་ནི་ནམ་ཡང་ཉོན་མོངས་བྱར་མི་ནུས། །
en: But this natural luminosity that is the perfect mind of awakening Can never be defiled.”

source: ཐམས་ཅད་མཁྱེན་པའི་སེམས་རིན་པོ་ཆེ་ཡོངས་སུ་སྦྱང་བའི་ལེའུ་སྟེ་དང་པོའོ།། །།
en: [Chapter One: Refining the Precious Mind of Omniscience]

source: བློ་གྲོས་རྒྱ་མཚོ་ཐམས་ཅད་མཁྱེན་པར་སེམས་བསྐྱེད་པ་རིན་པོ་ཆེ་དེའི་གནོད་པ་བཟོད་པ་ནི་ཇི་ལྟ་བུ།
en: “Sāgaramati, how does one accept challenges to the jewel of developing the mind directed toward omniscience?

source: ཐམས་ཅད་མཁྱེན་པར་སེམས་བསྐྱེད་པ་རིན་པོ་ཆེ་དེའི་གནོད་པ་ནི་གང་ཞེ་ན།
en: What are the challenges to the jewel of developing the mind directed toward omniscience?

source: བློ་གྲོས་རྒྱ་མཚོ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐམས་ཅད་མཁྱེན་པར་སེམས་བསྐྱེད་པ་རིན་པོ་ཆེ་དེ་ལྟར་བསྐྱེད་ནས། འཕགས་པ་མ་ཡིན་པ་ཚུལ་ཁྲིམས་འཆལ་པའི་སེམས་ཅན་རྣམས་སམ། བདུད་རྣམས་སམ། བདུད་ཀྱི་རིས་ཀྱི་ལྷ་རྣམས་སམ། བདུད་ཀྱི་བྱིན་གྱིས་བརླབས་པ་རྣམས་སམ། བདུད་ཀྱི་ཕོ་ཉ་རྣམས་ཀྱིས་གཙེས་སམ། རྣམ་པར་གཙེས་སམ། བསྐྱོད་དམ། ཀུན་ཏུ་བསྐྱོད་དམ། དཀྲུགས་སམ། ཀུན་ཏུ་དཀྲུགས་སམ། བསྡིགས་སམ། བརྡེགས་ཀྱང་བྱང་ཆུབ་ཏུ་བསམ་པའི་སེམས་བསྐྱེད་པ་དེ་ལས་མི་ཕྱེད་པ་དང་།
en: “Sāgaramati, once bodhisattva great beings have engendered the jewel of developing the mind directed toward omniscience in the aforementioned manner, they will not lose their development of the intention to awaken in the face of ignoble beings who have corrupt discipline, māras, gods of the echelon of māra, those blessed by māras, threats from Māra’s messengers, menaces, disturbances, violent disturbances, agitation, violent agitation, threats, or abuse.

source: སེམས་ཅན་ཐམས་ཅད་རབ་ཏུ་ཐར་བར་བྱ་བའི་སྙིང་རྗེ་ཆེན་པོས་བརྩོན་འགྲུས་བརྩམས་པ་ལས་མི་ཕྱེད་པ་དང་།
en: They will not lose their compassionate diligence that seeks to free all beings.

source: དཀོན་མཆོག་གསུམ་གྱི་རིགས་མི་འཆད་པར་བྱ་བར་བརྩོན་པ་ལས་མི་ཕྱེད་པ་དང་།
en: They will not lose the effort needed to keep the lineage of the Three Jewels unbroken.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡང་དག་པར་བསྒྲུབ་པའི་དགེ་བའི་རྩ་བ་ལ་སྦྱོར་བ་ལས་མི་ཕྱེད་པ་དང་།
en: They will not lose their training in the roots of virtue that manifest the qualities of buddhahood.

source: མཚན་དང་དཔེ་བྱད་བཟང་པོ་ཡོངས་སུ་འགྲུབ་པར་འགྱུར་བའི་བསོད་ནམས་ཀྱི་ཚོགས་བསགས་པ་ལས་མི་ཕྱེད་པ་དང་།
en: They will not lose their accumulation of merit that manifests the major and minor marks of perfection.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་སྦྱང་བ་མངོན་པར་སྒྲུབ་པར་བརྩོན་པ་ལས་མི་ཕྱེད་པ་དང་།
en: They will not lose the effort needed to actualize the purification of buddha realms.

source: ལུས་དང་སྲོག་འདོར་ཞིང་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པར་མངོན་པར་བརྩོན་པ་ལས་མི་ཕྱེད་པ་དང་།
en: They will not lose their effort to give up concern for body and life and uphold the sublime Dharma.

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་མངོན་པར་བརྩོན་ཞིང་བདག་བདེ་བ་ལ་མི་ཆགས་པ་ལས་མི་ཕྱེད་པ་སྟེ།
en: They will not lose the effort to ripen all beings nor will they lose their lack of attachment to their personal happiness.

source: དེ་དེ་ལྟར་ལྷག་པའི་བསམ་པ་ཕུན་སུམ་ཚོགས་པར་གྱུར་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་དཔྱས་ཀྱང་བཟོད། ཐིང་སླད་བྱས་པ་དང་། སྨད་པ་དང་། བཤུང་བ་བྱས་ཀྱང་བཟོད།
en: “Because they have such abundant motivation, even if all beings were to belittle, blame, slander, or curse them, they will accept it.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱིས་སྤྱོས་སམ་བསྡིགས་སམ་ངན་དུ་བརྗོད་དམ། ངན་དུ་སྨྲས་པའི་ཚིག་གི་ལམ་ཡང་བཟོད།
en: They will accept any ridicule, threats, bad words, or cruel words spoken by beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་གནོད་པ་ཡང་བཟོད།
en: They will accept all harm caused by beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཁུར་ཡང་བཟོད།
en: They will accept the burden of all beings.

source: སྒྲོལ་བས་ཀྱང་སྐྱོ་བ་མེད། ཞུམ་པ་མེད། ཀུན་ཏུ་ཞུམ་པ་མེད། སྒྱིད་ལུག་པ་མེད། ཡི་ཆད་པ་མེད་ཀྱི་སྟོབས་ཉེ་བར་སྟོན་པར་བྱེད།
en: Since they are liberated, they reveal their strength by not becoming sad, discouraged, depressed, disheartened, or doubtful.

source: མཐུ་སྐྱེད་པར་བྱེད་ཅིང་བརྩོན་འགྲུས་རྩོམ་ལ་རྟུལ་བས་རྟུལ་བར་བྱེད་དེ། སྤྲོ་བསྐྱེད་ཅིང་རྨོངས་པའི་སེམས་མི་འཛིན་ཏོ། །
en: They will arouse their strength, develop their diligence, bring forth their effort, inspire enthusiasm, and not engage in any deluded states of mind.

source: དེ་སྤྱོས་ཀྱང་སླར་མི་གཤེ།
en: Though mocked, they will not return it with ridicule.

source: བརྡེགས་ཀྱང་སླར་མི་རྡེག །
en: Though struck, they will not strike back.

source: ཁྲོས་ཀྱང་སླར་མི་ཁྲོ།
en: Though shown anger, they will not be angry in return.

source: འཁྲུགས་ཀྱང་སླར་མི་འཁྲུག་སྟེ།
en: Though others may fight with them, they will not fight back.

source: དེ་ལྟར་སེམས་ཅན་བགྲང་བའི་གོ་ཆ་གྱོན་ནོ། །
en: In this manner they don the armor that is considerate of beings.

source: འདི་ལྟ་སྟེ། ཐེག་པ་ཆེན་པོ་འདི་ནི་འཇིག་རྟེན་ཐམས་ཅད་དང་མི་འཐུན་པའི་ཐེག་པའོ། །
en: “The point is that the Great Vehicle is a vehicle that does not conform to the world.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why is this?

source: སེམས་ཅན་དེ་དག་ནི་རྒྱུན་གྱི་རྗེས་སུ་འགྲོ་བ་དག་གོ །
en: Beings always go with the flow.

source: བདག་ནི་རྒྱུན་ལས་ལྡོག་པར་རྩོལ་བར་འདོད་པའོ། །
en: I wish to deliberately go against the stream.

source: སེམས་ཅན་དེ་དག་ནི་ཕན་ཚུན་མི་འཐུན་པ་དག་གོ། །
en: Beings cannot manage to be harmonious with one another.

source: བདག་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མི་འཐུན་པ་སྤང་བའི་ཕྱིར་གོ་ཆ་བགོས་པའོ། །
en: I wear the armor that allows me to discard whatever would cause disharmony with beings.

source: སེམས་ཅན་དེ་དག་ནི་གནོད་སེམས་ལ་དཔའ་བ་དག་གོ། །
en: Beings act like heroes when it comes to malice.

source: བདག་ནི་བཟོད་པ་དང་། ངེས་པ་ཡོངས་སུ་ཚོལ་བའོ། །
en: I seek out acceptance and gentleness.

source: སེམས་ཅན་དེ་དག་ནི་གཅིག་ལ་གཅིག་ཡོངས་སུ་འདྲིད་པར་གནས་པ་དག་གོ། །
en: Beings are always fed up with one another.

source: བདག་ནི་ཤེས་རབ་ཀྱིས་ངོམས་པ་ཡོངས་སུ་ཚོལ་བའོ། །
en: I seek to appease them by means of insight.

source: གལ་ཏེ་སེམས་ཅན་དེ་དག་ཕྱོགས་བཅུའི་རབ་ཏུ་དབྱེ་བས་རབ་ཏུ་ཕྱེ་བ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་རལ་གྲི་དང་། མདུང་ཐུང་དང་མདའ་བོ་ཆེ་ལག་ན་ཐོགས་ཏེ། བདག་གི་ཕྱི་བཞིན་འབྲང་ཡང་། ས་ཕྱོགས་གང་དུ་འགྲེང་ངམ་འདུག་གམ་འཆག་གམ་ཉལ་ཡང་རུང་སྟེ། བྱང་ཆུབ་ཀྱི་སེམས་སྐྱེ་བར་འགྱུར་བ་དང་།
en: “If all the beings from every point throughout the ten directions were to brandish swords, clubs, and arrows, and hound me wherever I stood, sat, walked, or lay, still the mind of awakening would arise.

source: སྦྱིན་པའི་སེམས་སམ། ཚུལ་ཁྲིམས་ཀྱི་སེམས་སམ། བཟོད་པའི་སེམས་སམ། བརྩོན་འགྲུས་ཀྱི་སེམས་སམ། བསམ་གཏན་གྱི་སེམས་སམ། ཤེས་རབ་ཀྱི་སེམས་སམ། ཐོས་པའི་དགེ་བའི་རྩ་བའི་སེམས་སྐྱེ་བར་འགྱུར་བའི་
en: The mind of generosity, the mind of discipline, the mind of patience, the mind of diligence, the mind of concentration, the mind of insight, and the mind of the roots of virtue that come from study would arise.

source: ས་ཕྱོགས་དེར་ད་བདག་ལུས་རྒྱ་ཤུག་གི་ལོ་མའི་བརྒྱ་ཆ་ཙམ་དུ་གཏུབས་སམ། རྣམ་པར་གཏོར་ཏམ། རྣམ་པར་བཅོམ་མམ། སེམས་ཅན་དེ་དག་ཐམས་ཅད་ལས་གཞན་མི་བྱེད་པར་རྒྱུན་ཏུ་གཤེ་འམ། བསྡིགས་སམ། སྨོད་དམ། བཤུང་ངམ། ཚིག་ངན་པ་དང་ངག་རྩུབ་པོ་སྨྲ་བ་དེ་ལྟར་གྱུར་ཀྱང་བདག་གིས་སེམས་ཅན་འགའ་ལ་ཡང་འཁྲུག་པའི་སེམས་བསྐྱེད་པར་མི་བྱའོ། །
en: In such places, then even if beings were to chop my body up into a hundred pieces, and crush and scatter it like juniper leaves—even if those beings were to do nothing but scold me, slander me, belittle me, complain about me, and speak nothing but nasty things about me—still I would not allow my mind to become disturbed.

source: སྔོན་གྱི་མཐའ་ནས་འཁོར་བ་ཚད་མེད་པར་བྱས་ཏེ།
en: “Since the beginning, countless time has passed in saṃsāra.

source: གང་དུ་བདག་གིས་ལུས་འདི་སེམས་ཅན་དམྱལ་བར་སོང་ངམ། དུད་འགྲོའི་སྐྱེ་གནས་སུ་སོང་ངམ། གཤིན་རྗེའི་འཇིག་རྟེན་དུ་སོང་ངམ། མིར་གྱུར་ཀྱང་རུང་སྟེ་འདོད་པའི་ཟས་ཀྱི་དྲི་མས་དྲི་མ་ཅན་དུ་གྱུར་ནས་
en: Wherever I have taken a body—in the realms of hell, animals, the Lord of Death, or that of humans—I have been stained by the enjoyment of desire.

source: ཆོས་ཐོས་པ་དང་མི་ལྡན་ཞིང་ཡང་བའི་འཚོ་བའི་སྤྱོད་ཡུལ་དོན་མེད་པས་འཚོ་བ་ཅན་དུ་གྱུར་ཏེ་
en: I lacked the study of Dharma and sustained myself on dangerous forms of livelihood that ended up being fruitless.

source: ཡན་ལག་དང་། ཉིང་ལག་བརྒྱར་གཤེགས་ཤིང་གཏུབས་ཏེ་ཕྱེ་ཞིང་ཕྲལ་ལ་བྱ་བ་རྣམ་པ་མང་པོ་བྱས་ཀྱང་བདག་གིས་གཞི་དེ་ལས་བདག་གི་དོན་བྱས་ཀྱིས་གཞན་གྱི་དོན་མ་བྱས་པའི་
en: Even though my limbs and digits were shredded, cut, divided, and torn into small pieces, I continued pursuing my own ends, and not the ends of others.

source: གལ་ཏེ་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱིས། !ཕྱི་མའི་མཐར་བདག་གིས་ལུས་གཤེགས་གཏུབས་རྣམ་པར་གཏོར་རྣམ་པར་བཅོམ་པ་དེ་ལྟ་བུར་གྱུར་ཀྱང་བདག་གིས་ཐམས་ཅད་མཁྱེན་པ་ཡོངས་སུ་མི་གཏོང་ངོ་། །
en: So now, if all these beings henceforth shred, cut, scatter, and crush my body, I will not give up on omniscience.

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མི་གཏོང་ངོ་། །
en: I will not give up on sentient beings.

source: དགེ་བའི་ཆོས་ལ་འདུན་པ་ཡོངས་སུ་མི་གཏོང་ངོ་། །
en: I will not give up our pursuit of virtuous phenomena.

source: ལུས་གཏུབས་པའི་ལུས་ཀྱི་གནོད་པ་འདི་ལྟ་བུ་ཐམས་ཅད་ནི་སེམས་ཅན་དམྱལ་བའི་སྡུག་བསྔལ་གྱི།
en: “All the harm of having one’s body cut apart does not represent even one percent of the suffering endured by beings in hell;

source: བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་བ་ནས་རྒྱུའི་བར་དུ་ཡང་མི་བཟོད་དོ། །
en: no comparison would suffice.

source: བདག་ནི་སེམས་ཅན་དམྱལ་བར་གནས་པར་སྤྲོའི། བདག་གིས་སངས་རྒྱས་ཀྱི་ཆོས་གཏང་བར་ནི་མི་བྱའོ། །
en: Yet I am delighted to stay in the hell realms, and I will not give up on the qualities of buddhahood.

source: སེམས་ཅན་ཐམས་ཅད་རབ་ཏུ་ཐར་བར་བྱ་བ་ལ་དམིགས་པའི་སྙིང་རྗེ་ཆེན་པོ་མི་གཏོང་ངོ་། །
en: I will not give up on great compassion that aims to free all beings.

source: དེ་ནི་བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་གསུངས་ཏེ། དགེ་བ་ལ་ནི་བར་ཆད་མང་ངོ་། །
en: “The Blessed One has said that there are many obstacles to virtue.

source: མི་དགེ་བའི་ཕྱོགས་ལ་ནི་གྲོགས་བྱེད་པ་མང་ངོ་། །དགེ་བའི་ཕྱོགས་ལ་ནི་གྲོགས་བྱེད་པ་ཉུང་ངོ་
en: There are many who would accompany me to nonvirtue, and few who would accompany me to virtue.

source: ཞེས་གསུངས་པས་བདག་གིས་མི་དགེ་བའི་ཕྱོགས་ཀྱི་གྲོགས་མི་བྱའི་དགེ་བའི་ཕྱོགས་ཀྱི་གྲོགས་བྱའོ། །
en: So, I will not be a companion for the journey to nonvirtue. I will be a companion for the journey to virtue.

source: སེམས་ཅན་ཐམས་ཅད་ལ་བཟོད་པར་བྱའི་གནོད་སེམས་སུ་མི་བྱའོ། །
en: I will accept all beings. I will not allow malice to crop up in the mind.

source: སེམས་ཅན་དེ་དག་ལ་གང་ཡོད་པ་དེ་མ་བྱིན་ན་ཡང་བདག་ལ་གང་ཡོད་པ་དེ་བདག་གིས་སྦྱིན་པར་བྱ་སྟེ།
en: I will give away everything that I have, even though others may not give me anything.

source: སེམས་ཅན་དེ་དག་ལ་གནོད་སེམས་དང་ཁྲོ་བ་དང་། འཁོན་དུ་འཛིན་པ་ཡོད་པ་དེ་དག་དེ་རྣམས་ཀྱིས་མ་བྱིན་ཡང་བདག་ལ་བཟོད་པ་དང་དེས་པ་གང་ཡོད་པ་དེ་བདག་གིས་སྦྱིན་པར་བྱའོ། །
en: Even though beings who are filled with malice, rage, and spite cannot give their things away, I will give what I have with patience and gentleness.

source: བདག་གིས་བཟོད་པའི་སྟོབས་བསྟན་པར་བྱའི་གནོད་སེམས་ནི་མ་ཡིན་ནོ་སྙམ་མོ། །
en: I intend to teach the power of patience, not malice.

source: བློ་གྲོས་རྒྱ་མཚོ་ལུས་དང་སྲོག་འདོར་བའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་རྙེད་པར་དཀའ་བ་མ་ཡིན་ནོ། །
en: “Sāgaramati, unsurpassed and perfect awakening is not difficult to attain for bodhisattvas who are ready to give up their bodies and life.

source: གང་གི་གཞི་ལས་གནོད་སེམས་འབྱུང་བའི་ཆོས་དེ་བདག་གིས་སྤང་བར་བྱའོ་སྙམ་མོ། །
en: They intend to eliminate any phenomena that support the development of malice.

source: ཆོས་དེ་གང་ཞེ་ན།
en: What are these phenomena?

source: འདི་ལྟ་སྟེ་ལུས་ལ་དགའ་བ་དང་། ལུས་ལ་གནས་པ་དང་། ལུས་ལ་ཆགས་པ་སྟེ།
en: They are taking joy in the body, being settled in the body, and being attached to the body.

source: ལུས་བཏང་ན་གནོད་སེམས་ཀྱང་གཏོང་ངོ་། །
en: If one gives up the body, malice is also given up.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ལྟར་བགྲང་བ་ལ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་གནོད་པ་བཟོད་དེ་མི་སྐྱོ་མི་ཁྲོའོ། །
en: “Sāgaramati, bodhisattva great beings who share this outlook accept the harm of beings and do not become depressed or angry.

source: དེ་གནོད་པ་གསུམ་བཟོད་དེ།
en: They accept three forms of harm.

source: གསུམ་གང་ཞེ་ན།
en: What are these three?

source: ལུས་ཀྱི་གནོད་པ་དང་། ངག་གི་གནོད་པ་དང་། སེམས་ཀྱི་གནོད་པའོ། །
en: Physical, verbal, and mental harm.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ཀྱི་གནོད་པ་བཟོད་པ་གང་ཞེ་ན།
en: “What is the bodhisattvas’ acceptance of physical harm, Sāgaramati?

source: གང་ཡན་ལག་དང་ཉིང་ལག་རྣམས་བཅད་ཀྱང་ཆོས་ཉིད་ལ་རྟོན་ཏེ་གང་དེའི་ལུས་གཅོད་པའི་སེམས་ཅན་དེ་ཉིད་ལ་ལྟ་བའོ། །
en: When their limbs or digits are cut, they rely on reality and look into the identity of the being who is cutting their body.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ལ་ཐབས་ལ་མཁས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ལུས་གཅོད་པ་ན་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: Sāgaramati, when the bodies of bodhisattvas who are skilled in means are cut, they complete their cultivation of the six perfections.

source: བློ་གྲོས་རྒྱ་མཚོ་ཇི་ལྟར་ན་ཐབས་ལ་མཁས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ལུས་གཅོད་པ་ན་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཞེ་ན།
en: Sāgaramati, when the bodies of bodhisattvas who are skilled in means are cut, how do they complete their cultivation of the six perfections?

source: གང་ལུས་འདོར་བ་དང་ལུས་ཡོངས་སུ་གཏོང་བ་དང་ལུས་ལ་མི་ལྟ་བ་འདི་ནི་དེའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: “Abandoning the body, giving away the body, and ignoring the body is their perfection of generosity.

source: གང་ལུས་གཅོད་པ་ན་སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པས་ཁྱབ་པར་བྱེད་པ་དང་། ཚོར་བ་རྣམས་ཀྱིས་མི་འཕྲོགས་པ་འདི་ནི་དེའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Filling themselves with love for all beings and not getting overwhelmed by the physical sensation when the body is cut is their perfection of discipline.

source: གང་ལུས་ཡོངས་སུ་གཅོད་པ་ན་གང་དག་དེའི་ལུས་གཅོད་པ་དེ་དག་ཉིད་རབ་ཏུ་ཐར་བར་བྱ་བའི་ཕྱིར་བཟོད་ཅིང་སེམས་ཀྱི་རྨ་མི་ཕྱིན་ཏེ། བཟོད་པའི་སྟོབས་ཉེ་བར་སྟོན་པ་འདི་ནི་དེའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Accepting the cutting of the body for the sake of becoming free, not letting their minds be marred, and displaying their power of acceptance is their perfection of patience.

source: བརྩོན་འགྲུས་གང་གིས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་འདུན་པ་མི་འདོར་ཞིང་སེམས་ཀྱི་སྟོབས་བསྐྱེད་པ་ཡང་རབ་ཏུ་འཛིན་ལ་འཁོར་བ་ཉིད་དུ་མཚམས་ཀྱང་སྦྱོར་ཞིང་དགེ་བའི་རྩ་བ་བརྩམ་པ་ཡང་རྩོམ་པ་འདི་ནི་དེའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Utilizing diligence to not lose their passion for omniscience, holding to the strengthening of mind, embracing saṃsāra, and engaging in roots of virtue is their perfection of diligence.

source: གང་ལུས་རྣམ་པར་འཐོར་བ་ན་ཐམས་ཅད་མཁྱེན་པའི་སེམས་བསྐྱེད་པ་རིན་པོ་ཆེ་དེ་མི་བརྗེད་ཅིང་བྱང་ཆུབ་ཉིད་ལ་ལྟ་བ་དང་། ཞི་བ་དང་རབ་ཏུ་ཞི་བ་ལ་སོ་སོར་རྟོག་པ་འདི་ནི་དེའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: As their bodies are cast aside, not forgetting the jewel of developing the mind of omniscience, focusing on awakening itself, and contemplating peace and utter peace is their perfection of concentration.

source: གང་ལུས་གཅོད་པ་ན་ལུས་ལ་རྩྭ་དང་། རྩིག་པ་དང་། ཤིང་དང་། རྡོ་དང་། མིག་ཡོར་ལྟ་བུར་སོ་སོར་རྟོག་ཅིང་ལུས་ལ་སྒྱུ་མའི་ཆོས་ཉིད་དུ་འཇུག་པ་དང་།
en: When the body is cut, contemplating how the body is like grass, a wall, wood, stone, or a visual distortion; engaging with the body as having the nature of an illusion;

source: ཡང་དག་པར་ན་མི་རྟག་པ་ཉིད་དང་། ཡང་དག་པར་ན་སྡུག་བསྔལ་བ་ཉིད་དང་། ཡང་དག་པར་ན་བདག་མེད་པ་ཉིད་དང་། ཡང་དག་པར་ན་ཞི་བ་ཉིད་དུ་ལུས་ལ་རྟོག་པ་འདི་ནི་དེའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: and contemplating how the body is actually impermanent, suffering, devoid of self, and peace is their perfection of insight.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ལྟར་ན་ཐབས་ལ་མཁས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ལུས་གཅོད་པ་ན། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཞིང་ཐེག་པ་ཆེན་པོ་དེ་ལས་ཉམས་པར་མི་འགྱུར་ཏེ་
en: “Thus, Sāgaramati, when the bodies of bodhisattvas who are skilled in means are cut, they complete their cultivation of the six perfections and do not fall away from the Great Vehicle.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ཀྱི་གནོད་པ་བཟོད་པའོ། །
en: This is the bodhisattvas’ acceptance of physical harm.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ངག་གི་གནོད་པ་བཟོད་པ་གང་ཞེ་ན།
en: “What is the bodhisattvas’ acceptance of verbal harm, Sāgaramati?

source: གང་ངན་དུ་བརྗོད་པའི་ཚིག་ཐམས་ཅད་དང་དུ་ལེན་པ་དང་།
en: It is inviting all meanly spoken words.
